app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings"

  def show
    @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = 1 LIMIT 1

  def edit
    @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = 1 LIMIT 1

  def create
    @listing = Listing.new(params[:listing])
    @listing.start_time =
      Time.mktime(params[:listing]['start_time(1i)'].to_i, params[:listing]['start_time(2i)'].to_i,
      params[:listing]['start_time(3i)'].to_i, params[:start_time]['hour'].to_i, params[:start_time]['minute'])

    @listing.end_time =
      Time.mktime(params[:listing]['start_time(1i)'].to_i, params[:listing]['start_time(2i)'].to_i,
      params[:listing]['start_time(3i)'].to_i, params[:end_time]['hour'].to_i, params[:end_time]['minute'])

    #add the image
    if params.has_key?(:image)
      @listing.images.build :url =>  params[:image]
    end

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("longitude", "start_time", "address", "description", "end_time", "gmaps", "updated_at", "end_day", "created_at", "start_day", "latitude") VALUES (-122.9574212, '2011-09-04 20:23:00.000000', '7108 Collier St, Burnaby, Canada', 'Foo1', '2011-09-04 20:23:00.000000', 't', '2011-09-04 20:23:42.943143', '2011-09-04', '2011-09-04 20:23:42.943143', '2011-09-04', 49.2206884)